In [1]:
import pandas as pd

city_list = pd.read_csv('data/city_list.csv')
global_data = pd.read_csv('data/global_data.csv')
city_data = pd.read_csv('data/city_data.csv')

In [2]:
city_data.head()

   year     city        country  avg_temp
0  1849  Abidjan  Côte D'Ivoire     25.58
1  1850  Abidjan  Côte D'Ivoire     25.52
2  1851  Abidjan  Côte D'Ivoire     25.67
3  1852  Abidjan  Côte D'Ivoire       NaN
4  1853  Abidjan  Côte D'Ivoire       NaN

In [3]:
global_data.head()

   year  avg_temp
0  1750      8.72
1  1751      7.98
2  1752      5.78
3  1753      8.39
4  1754      8.47

In [4]:
city_list.head()

        city               country
0    Abidjan         Côte D'Ivoire
1  Abu Dhabi  United Arab Emirates
2      Abuja               Nigeria
3      Accra                 Ghana
4      Adana                Turkey

In [8]:
us_cities = city_list[ city_list.country=='United States' ].city
us_cities

8           Albuquerque
10           Alexandria
19            Arlington
23              Atlanta
24               Austin
27            Baltimore
46           Birmingham
48               Boston
66            Charlotte
69              Chicago
73     Colorado Springs
74             Columbus
81               Dallas
86               Denver
87              Detroit
96              El Paso
98           Fort Worth
102              Fresno
124             Houston
128        Indianapolis
134        Jacksonville
146         Kansas City
168           Las Vegas
176          Long Beach
178         Los Angeles
179          Louisville
199             Memphis
200                Mesa
202               Miami
204           Milwaukee
205         Minneapolis
221           Nashville
224         New Orleans
225            New York
229             Oakland
230       Oklahoma City
231               Omaha
243        Philadelphia
244             Phoenix
250            Portland
262             Raleigh
271          Sacramento
274         San Antonio
275           San Diego
276       San Francisco
277            San Jose
286             Seattle
317              Tucson
318               Tulsa
330      Virginia Beach
333          Washington
335             Wichita
Name: city, dtype: object

In [10]:
city_data[ (city_data.city.isin(us_cities)) & (city_data.country != 'United States') ].groupby(['city','country']).size()

city         country
Alexandria   Egypt             223
Birmingham   United Kingdom    271
Los Angeles  Chile             159
dtype: int64

In [11]:
city_data[ city_data.country=='United States' ].groupby(['city','country']).size()

city              country
Albuquerque       United States    194
Alexandria        United States    271
Arlington         United States    271
Atlanta           United States    271
Austin            United States    194
Baltimore         United States    271
Birmingham        United States    271
Boston            United States    271
Charlotte         United States    271
Chicago           United States    271
Colorado Springs  United States    239
Columbus          United States    271
Dallas            United States    194
Denver            United States    239
Detroit           United States    271
El Paso           United States    189
Fort Worth        United States    194
Fresno            United States    165
Houston           United States    194
Indianapolis      United States    271
Jacksonville      United States    271
Kansas City       United States    256
Las Vegas         United States    179
Long Beach        United States    165
Los Angeles       United States    165
Louisville        United States    271
Memphis           United States    271
Mesa              United States    179
Miami             United States    256
Milwaukee         United States    271
Minneapolis       United States    271
Nashville         United States    271
New Orleans       United States    256
New York          United States    271
Oakland           United States    165
Oklahoma City     United States    246
Omaha             United States    256
Philadelphia      United States    271
Phoenix           United States    179
Portland          United States    186
Raleigh           United States    271
Sacramento        United States    165
San Antonio       United States    194
San Diego         United States    165
San Francisco     United States    165
San Jose          United States    165
Seattle           United States    186
Tucson            United States    179
Tulsa             United States    256
Virginia Beach    United States    271
Washington        United States    271
Wichita           United States    246
dtype: int64

In [12]:
city_list.groupby(['country']).size()

country
Afghanistan                            1
Albania                                1
Algeria                                1
Angola                                 1
Argentina                              2
Armenia                                1
Australia                              6
Austria                                1
Azerbaijan                             1
Bahamas                                1
Bahrain                                1
Bangladesh                             2
Belarus                                1
Belgium                                1
Bolivia                                1
Bosnia And Herzegovina                 1
Botswana                               1
Brazil                                11
Bulgaria                               1
Burkina Faso                           1
Burundi                                1
Cameroon                               1
Canada                                 6
Central African Republic               1
Chile                                  2
China                                 34
Colombia                               2
Congo                                  1
Congo (Democratic Republic Of The)     2
Croatia                                1
                                      ..
Singapore                              1
Slovakia                               1
Slovenia                               1
Somalia                                1
South Africa                           4
South Korea                            1
Spain                                  3
Sri Lanka                              1
Sudan                                  2
Suriname                               1
Sweden                                 1
Switzerland                            1
Syria                                  1
Taiwan                                 3
Tajikistan                             1
Tanzania                               1
Thailand                               1
Tunisia                                1
Turkey                                 5
Uganda                                 1
Ukraine                                1
United Arab Emirates                   1
United Kingdom                         5
United States                         52
Uruguay                                1
Uzbekistan                             1
Venezuela                              5
Vietnam                                2
Zambia                                 1
Zimbabwe                               1
Length: 137, dtype: int64

In [14]:
city_list.groupby(['country']).size().reset_index(name='count').sort_values(['count'], ascending=False)[:20]

            country  count
130   United States     52
25            China     34
55            India     22
17           Brazil     11
93         Pakistan      9
101          Russia      9
79           Mexico      8
91          Nigeria      7
6         Australia      6
56        Indonesia      6
22           Canada      6
62            Japan      6
125          Turkey      5
133       Venezuela      5
129  United Kingdom      5
111    South Africa      4
96      Philippines      3
57             Iran      3
120          Taiwan      3
44          Germany      3